newsData = [{
    title: "Microsoft анонсировала Visual Studio 2022",
    content: "Microsoft анонсировала новую версию Visual Studio 2022, стабильная версия которой выйдет во второй половине этого года.",
    date: "20.04.2021",
  },
  {
    title: "Энтузиаст разработал Tinder для программистов — в нём лайкают строки кода вместо фотографий",
    content: "Программист из США Бен Авад разработал сервис знакомств для программистов.",
    date: "10.12.2020",
  },
  {
    title: "Tesla опровергла слова Илона Маска о сроках перехода к полному автопилоту",
    content: "Представители Tesla встретились с регулирующими органами Калифорнии. По итогам встречи вышел меморандум, который опровергает сроки перехода компании к полностью автономным системам вождения, ранее озвученные Илоном Маском.",
    date: "06.05.2021",
  },
  {
    title: "Ученые с помощью иллюзорных квадратов изучили, как работает кошачье зрение",
    content: "Команда ученых из Австралии и США во главе с Габриэллой Смит из Хантерского колледжа решила выяснить, воспринимают ли кошки иллюзии квадрата. Исследователи установили, что питомцы любят сидеть не только в коробках или на квадратах на полу, но и имеют зрительные иллюзии квадратов, то есть, восприимчивы к оптическим иллюзиям.",
    date: "06.05.2021",
  },
  {
    title: "GitHub восстановил репозиторий с проектом реверс-инжиниринга движка GTA 3",
    content: "GitHub восстановил форк фанатского проекта re3 по реверс-инжинирингу Grand Theft Auto 3 и Vice City. Ранее его удалили из-за Закона о защите авторских прав в цифровую эпоху (DMCA).",
    date: "08.05.2021",
  },
  {
    title: "Правительство утвердило использование радиочастот в диапазоне 24 ГГц для сетей 5G",
    content: "По информации «Интерфакс», правительство РФ утвердило изменения в таблицу распределения полос радиочастот, в соответствии с которыми частоты в диапазоне 24 ГГц могут использоваться для создания сетей 5G.",
    date: "08.05.2021",
  },
]